benchmarks/stationaryBubble/full/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    xMin
    {
        type            fixedValue;
	value uniform (0 0 0);
    }

    xMax
    {
      // type            cyclic;
      type            fixedValue;
      value uniform (0 0 0);
    }

    yMin
    {
      //type            cyclic;
      type            fixedValue;
      value uniform (0 0 0);
    }

    yMax
    {
      //type            cyclic;
      type            fixedValue;
      value uniform (0 0 0);
    }

    zMin
    {
        type            empty;
    }

    zMax
    {
        type            empty;
    }
}


// ************************************************************************* //
