benchmarks/stationaryBubble/full/system/ijkDict
{
cellSet domain;
cyclicX true;
cyclicY true;
}